path_math_strange_1 = "img/strange_1"
path_math_strange_2 = "img/strange_2"

jrt_math_strange_1 = [
    [f"{path_math_strange_1}/math_1.png", (False, True, False, False), 1],
    [f"{path_math_strange_1}/math_2.png", (False, False, True, False), 2],
    [f"{path_math_strange_1}/math_3.png", (False, True, False, False), 1],
    [f"{path_math_strange_1}/math_4.png", (False, True, False, False), 1],
    [f"{path_math_strange_1}/math_5.png", (False, False, False, True), 3],
    [f"{path_math_strange_1}/math_6.png", (False, False, False, True), 3],
    [f"{path_math_strange_1}/math_7.png", (False, True, False, False), 1],
    [f"{path_math_strange_1}/math_8.png", (True, False, False, True), 0],
    [f"{path_math_strange_1}/math_9.png", (False, True, False, False), 1],
    [f"{path_math_strange_1}/math_10.png", (True, False, False, False), 0],
]


jrt_math_strange_2 = [
    [f"{path_math_strange_2}/math_1.png", ["90", "100", "120", "150", "200"], 4],
    [f"{path_math_strange_2}/math_2.png", ["50", "80", "100", "140", "yти аныктоого маалымат жетишсиз"], 4],
    [f"{path_math_strange_2}/math_3.png", ["35º", "40º", "60º", "70º", "80º"], 3],
    [f"{path_math_strange_2}/math_4.png", ["1", "100", "101", "200", "201"], 2],
    [f"{path_math_strange_2}/math_5.png", ["1,05", "1,3", "1,4", "1,5", "2,1"], 0],
    [f"{path_math_strange_2}/math_6.png", ["300", "325", "350", "375", "400"], 2],
    [f"{path_math_strange_2}/math_7.png", ["20", "30", "40", "50", "60"], 1],
    [f"{path_math_strange_2}/math_8.png", ["2000", "2001", "2003", "2005", "2006"], 4],
    [f"{path_math_strange_2}/math_9.png", ["14", "28", "35", "42", "49"], 2],
    [f"{path_math_strange_2}/math_10.png", ["80", "100", "120", "140", "160"], 0],
]


jrt_analogia = [
    [
        "данек : өрүк",
        ["бармак : кол", "боор : дене", "топ : спорт", "шак : дарак"],
        1
    ],
    [
        "таянуу : жөлөнүү",
        ["атактуу : даңктуу", "айлана : чөйрө", "этияттоо : абайлоо", "жакшы : дурус"],
        2
    ],
    [
        "кемитүү : азыраак",
        ["мактоо : жакшыраак", "өркүндөтүү : жакшыраак", "өзгөртүү : жакшыраак", "кошуу : жакшыраак"],
        1
    ],
    [
        "фото : жарык",
        ["кымыз : саба (чанач)", "орок : балка", "калем : кагаз", "жаа : жебе"],
        3
    ],
    [
        "такшалуу : эмгектенүү",
        ["табыштоо : ишенүү", "кемитүү : кошуу", "тандоо : ойлонуу", "улантуу : жолдоо"],
        0
    ],
    [
        "баёолук : тазалык",
        ["бейкуттук : тынчтык", "сабырдуулук : олуттуулук", "чыдамкайлык : көктүк", "назиктик : сулуулук"],
        0
    ],
    [
        "шашма : жаңылуу",
        ["акылдуу : окуу", "түркөй : билим алуу", "сезимтал : таасирленүү", "чуркоо: машыгуу"],
        2
    ],
    [
        "шам : караңгылык",
        ["фотоаппарат : кадр", "лампа : жарык", "кийим : суук", "комуз : тынчтык"],
        3
    ],
    [
        "мектеп : окуучу",
        ["муз : тайгалак", "көл : суу", "унаа : көчө", "кеме : деңиз"],
        1
    ],
    [
        "жумушчу : бекерчи",
        ["жандуу : пассивдүү", "гүл : бүчүр", "бактылуу : көңүлдүү", "тапшырма : көнүгүү"],
        0
    ],
    [
        "тонометр : басым",
        ["сынак : билим", "саманчынын жолу : күн", "узундук : эн", "миллиметр : көлөм"],
        0
    ],
]

jrt_grammar = [
    [
        "Сенин ордуңда башка бирөө болсо, өлбөгөн төрт шыйрагы калат эле. Сен таза көк турбайсыңбы...\n\nАсты сызылган сөз тизмеги кандай мааниде колдонулду?",
        ["Аябай арыктап кетүү", "Уялганынан баш көтөрө албоо", "Аябай жакырланып кетүү", "Эмне кыларын билбей калуу"],
        1
    ],
    [
        "Кайсы катардагы сүйлөмдүн биринчи бөлүгү экинчи бөлүгүнө карама-каршы мааниде турат?",
        ["Анын кейип-кепчигенин уккуча, үйдө отурам.", "Акылбек театрга баргыча, спектакль бүтүп калыптыр.", "Кино бүткүчө, сүйлөшүп да бүттүк.", "Досу окууну бүтүргүчө, бизнесин куруп алды."],
        0
    ],
    [
        "Кайсы варианттагы сөздөр жазуу эрежесине ылайык жазылган?",
        ["канбай, түңкү, сиңген", "чамбай, күнгө, таңкы", "таңган, ишенби, көнгөн", "жамбы, танган, чаңдуу"],
        3
    ],
    [
        "Төмөнкү сүйлөмдөрдүн кайсынысында заттын үнүн туураган сөз колдонулду?",
        ["Акырын шыбырай сүйлөдү.", "Уккан кулагына ишенбей теңселе түштү.", "Күн өткөн сайын гүлдөй соолуп эле баратасың.", "Бутактар карсылдап сынып жатты."],
        3
    ],
    [
        "Кайсы вариантта татаал сөздөр берилген?",
        ["Чоң ата, акылдуу кыз", "Ачык мүнөз, анык сөз", "Күч-кубат, эл аралык", "Эл улуусу, эл камы"],
        2
    ],
    [
        "Кайсы вариантта сөз айкашы берилген?",
        ["Көк көйнөк", "Бөрү карагат", "Көк ала", "Аябай көк"],
        0
    ],
    [
        "Эрмек программалоо курсун бүтүр...\n\nКайсы катардагы мүчө уланса, капысынан билинген аракетти билдирет?",
        ["-ган", "-ыптыр", "-ды", "-чу"],
        1
    ],
    [
        "Саамал ичсе – кымыз жок, байтал минсе – кулун жок.\n\nБул сүйлөм канча жөнөкөй сүйлөмдөн турат?",
        ["төрт", "үч", "эки", "беш"],
        0
    ],
    [
        "-лар мүчөсүнүн жардамысыз көптүк маанини билдирген сөздөрдүн катарын табыңыз.",
        ["Дан, суу, таш", "Акыл, адам, ой", "Калк, кыз-кыркын, түшүм", "Ата-эне, уул бала, эпос"],
        2
    ],
    [
        "Кайсы вариантта айтылышы менен жазылышы ар башка, бирок бир маанини билдирген сөздөр берилген?",
        ["көйгөй, маселе, чечим", "дарт, илдет, оору", "иштерман, окурман, көрөрман", "алдуу, күчтүү, каардуу"],
        1
    ],
    [
        "Бир... класста эки... катардын бир... партасында отурган бир... менен урушуп кеткен.\n\nЧекиттердин ордуна кайсы катардагы мүчөлөрдү ирети менен жазсак, жогорудагы сүйлөмдүн мааниси туура болот?",
        ["-ынчы, -ынчы, -ынчы, -өө", "-ынчы, -өө, -ынчы,-ынчы", "-өө, -ынчы, -ынчы, -өө", "-ынчы, -өө, -ынчы,-өө"],
        0
    ],
]

